// Generated by jextract

package opencl;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct fattributiontag {
 *     unsigned int ft_flags;
 *     unsigned long long ft_hash;
 *     char ft_attribution_name[255];
 * }
 * }
 */
public class fattributiontag {

    fattributiontag() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        opencl_h.C_INT.withName("ft_flags"),
        MemoryLayout.paddingLayout(4),
        opencl_h.C_LONG_LONG.withName("ft_hash"),
        MemoryLayout.sequenceLayout(255, opencl_h.C_CHAR).withName("ft_attribution_name"),
        MemoryLayout.paddingLayout(1)
    ).withName("fattributiontag");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt ft_flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ft_flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int ft_flags
     * }
     */
    public static final OfInt ft_flags$layout() {
        return ft_flags$LAYOUT;
    }

    private static final long ft_flags$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int ft_flags
     * }
     */
    public static final long ft_flags$offset() {
        return ft_flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int ft_flags
     * }
     */
    public static int ft_flags(MemorySegment struct) {
        return struct.get(ft_flags$LAYOUT, ft_flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int ft_flags
     * }
     */
    public static void ft_flags(MemorySegment struct, int fieldValue) {
        struct.set(ft_flags$LAYOUT, ft_flags$OFFSET, fieldValue);
    }

    private static final OfLong ft_hash$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ft_hash"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned long long ft_hash
     * }
     */
    public static final OfLong ft_hash$layout() {
        return ft_hash$LAYOUT;
    }

    private static final long ft_hash$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned long long ft_hash
     * }
     */
    public static final long ft_hash$offset() {
        return ft_hash$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned long long ft_hash
     * }
     */
    public static long ft_hash(MemorySegment struct) {
        return struct.get(ft_hash$LAYOUT, ft_hash$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned long long ft_hash
     * }
     */
    public static void ft_hash(MemorySegment struct, long fieldValue) {
        struct.set(ft_hash$LAYOUT, ft_hash$OFFSET, fieldValue);
    }

    private static final SequenceLayout ft_attribution_name$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("ft_attribution_name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char ft_attribution_name[255]
     * }
     */
    public static final SequenceLayout ft_attribution_name$layout() {
        return ft_attribution_name$LAYOUT;
    }

    private static final long ft_attribution_name$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char ft_attribution_name[255]
     * }
     */
    public static final long ft_attribution_name$offset() {
        return ft_attribution_name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char ft_attribution_name[255]
     * }
     */
    public static MemorySegment ft_attribution_name(MemorySegment struct) {
        return struct.asSlice(ft_attribution_name$OFFSET, ft_attribution_name$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char ft_attribution_name[255]
     * }
     */
    public static void ft_attribution_name(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ft_attribution_name$OFFSET, ft_attribution_name$LAYOUT.byteSize());
    }

    private static long[] ft_attribution_name$DIMS = { 255 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char ft_attribution_name[255]
     * }
     */
    public static long[] ft_attribution_name$dimensions() {
        return ft_attribution_name$DIMS;
    }
    private static final VarHandle ft_attribution_name$ELEM_HANDLE = ft_attribution_name$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char ft_attribution_name[255]
     * }
     */
    public static byte ft_attribution_name(MemorySegment struct, long index0) {
        return (byte)ft_attribution_name$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char ft_attribution_name[255]
     * }
     */
    public static void ft_attribution_name(MemorySegment struct, long index0, byte fieldValue) {
        ft_attribution_name$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

