// Generated by jextract

package opencl;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct fsignatures {
 *     off_t fs_file_start;
 *     void *fs_blob_start;
 *     size_t fs_blob_size;
 *     size_t fs_fsignatures_size;
 *     char fs_cdhash[20];
 *     int fs_hash_type;
 * }
 * }
 */
public class fsignatures {

    fsignatures() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        opencl_h.C_LONG_LONG.withName("fs_file_start"),
        opencl_h.C_POINTER.withName("fs_blob_start"),
        opencl_h.C_LONG.withName("fs_blob_size"),
        opencl_h.C_LONG.withName("fs_fsignatures_size"),
        MemoryLayout.sequenceLayout(20, opencl_h.C_CHAR).withName("fs_cdhash"),
        opencl_h.C_INT.withName("fs_hash_type")
    ).withName("fsignatures");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong fs_file_start$LAYOUT = (OfLong)$LAYOUT.select(groupElement("fs_file_start"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * off_t fs_file_start
     * }
     */
    public static final OfLong fs_file_start$layout() {
        return fs_file_start$LAYOUT;
    }

    private static final long fs_file_start$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * off_t fs_file_start
     * }
     */
    public static final long fs_file_start$offset() {
        return fs_file_start$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * off_t fs_file_start
     * }
     */
    public static long fs_file_start(MemorySegment struct) {
        return struct.get(fs_file_start$LAYOUT, fs_file_start$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * off_t fs_file_start
     * }
     */
    public static void fs_file_start(MemorySegment struct, long fieldValue) {
        struct.set(fs_file_start$LAYOUT, fs_file_start$OFFSET, fieldValue);
    }

    private static final AddressLayout fs_blob_start$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("fs_blob_start"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *fs_blob_start
     * }
     */
    public static final AddressLayout fs_blob_start$layout() {
        return fs_blob_start$LAYOUT;
    }

    private static final long fs_blob_start$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *fs_blob_start
     * }
     */
    public static final long fs_blob_start$offset() {
        return fs_blob_start$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *fs_blob_start
     * }
     */
    public static MemorySegment fs_blob_start(MemorySegment struct) {
        return struct.get(fs_blob_start$LAYOUT, fs_blob_start$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *fs_blob_start
     * }
     */
    public static void fs_blob_start(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(fs_blob_start$LAYOUT, fs_blob_start$OFFSET, fieldValue);
    }

    private static final OfLong fs_blob_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("fs_blob_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t fs_blob_size
     * }
     */
    public static final OfLong fs_blob_size$layout() {
        return fs_blob_size$LAYOUT;
    }

    private static final long fs_blob_size$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t fs_blob_size
     * }
     */
    public static final long fs_blob_size$offset() {
        return fs_blob_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t fs_blob_size
     * }
     */
    public static long fs_blob_size(MemorySegment struct) {
        return struct.get(fs_blob_size$LAYOUT, fs_blob_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t fs_blob_size
     * }
     */
    public static void fs_blob_size(MemorySegment struct, long fieldValue) {
        struct.set(fs_blob_size$LAYOUT, fs_blob_size$OFFSET, fieldValue);
    }

    private static final OfLong fs_fsignatures_size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("fs_fsignatures_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t fs_fsignatures_size
     * }
     */
    public static final OfLong fs_fsignatures_size$layout() {
        return fs_fsignatures_size$LAYOUT;
    }

    private static final long fs_fsignatures_size$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t fs_fsignatures_size
     * }
     */
    public static final long fs_fsignatures_size$offset() {
        return fs_fsignatures_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t fs_fsignatures_size
     * }
     */
    public static long fs_fsignatures_size(MemorySegment struct) {
        return struct.get(fs_fsignatures_size$LAYOUT, fs_fsignatures_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t fs_fsignatures_size
     * }
     */
    public static void fs_fsignatures_size(MemorySegment struct, long fieldValue) {
        struct.set(fs_fsignatures_size$LAYOUT, fs_fsignatures_size$OFFSET, fieldValue);
    }

    private static final SequenceLayout fs_cdhash$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("fs_cdhash"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char fs_cdhash[20]
     * }
     */
    public static final SequenceLayout fs_cdhash$layout() {
        return fs_cdhash$LAYOUT;
    }

    private static final long fs_cdhash$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char fs_cdhash[20]
     * }
     */
    public static final long fs_cdhash$offset() {
        return fs_cdhash$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char fs_cdhash[20]
     * }
     */
    public static MemorySegment fs_cdhash(MemorySegment struct) {
        return struct.asSlice(fs_cdhash$OFFSET, fs_cdhash$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char fs_cdhash[20]
     * }
     */
    public static void fs_cdhash(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, fs_cdhash$OFFSET, fs_cdhash$LAYOUT.byteSize());
    }

    private static long[] fs_cdhash$DIMS = { 20 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char fs_cdhash[20]
     * }
     */
    public static long[] fs_cdhash$dimensions() {
        return fs_cdhash$DIMS;
    }
    private static final VarHandle fs_cdhash$ELEM_HANDLE = fs_cdhash$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char fs_cdhash[20]
     * }
     */
    public static byte fs_cdhash(MemorySegment struct, long index0) {
        return (byte)fs_cdhash$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char fs_cdhash[20]
     * }
     */
    public static void fs_cdhash(MemorySegment struct, long index0, byte fieldValue) {
        fs_cdhash$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfInt fs_hash_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("fs_hash_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int fs_hash_type
     * }
     */
    public static final OfInt fs_hash_type$layout() {
        return fs_hash_type$LAYOUT;
    }

    private static final long fs_hash_type$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int fs_hash_type
     * }
     */
    public static final long fs_hash_type$offset() {
        return fs_hash_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int fs_hash_type
     * }
     */
    public static int fs_hash_type(MemorySegment struct) {
        return struct.get(fs_hash_type$LAYOUT, fs_hash_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int fs_hash_type
     * }
     */
    public static void fs_hash_type(MemorySegment struct, int fieldValue) {
        struct.set(fs_hash_type$LAYOUT, fs_hash_type$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

